Autodesk.Revit.DB.ConicalSurface.IsValidConeAngle(System.Double)
Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
halfAngle:
Cone half-angle parameter.
Returns:
True if input is not 0, lesser than PI/2 and greater than -PI/2, false otherwise.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.GetFrameOfReference
Returns frame of reference associated with this ConicalSurface.
Remarks:
This is an equivalent of new Frame(Origin, XDir, YDir, Axis).
Returns:
Frame of reference associated with this ConicalSurface.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.Create(Autodesk.Revit.DB.Frame,System.Double)
Creates a conical surface defined by a local reference frame and a half angle.
Remarks:
The parametric equation of the cone is S(u, v) = Frame.Origin + v*[sin(halfAngle)(cos(u)*Frame.BasisX + sin(u)*Frame.BasisY) + cos(halfAngle)*Frame.BasisZ]
This implies the following facts:
Frame.BasisX points from the axis point to the point on the cylinder with coordinates (0, 0).Frame.BasisY points in the direction of the partial derivative dS/du at (0, 0).Frame.BasisZ points in the direction of the partial derivative dS/dv at (0, 0).
Only the branch of the cone with v >= 0 should be used.
frameOfReference:
frameOfReference is an orthonormal frame that defines a local coordinate system for the cone.
Frame.Origin is a point on the cylinder's axis.Frame.BasisZ points along the axis, while Frame.BasisX and Frame.BasisY are orthogonal to the axis. The frame may be either left-handed or right-handed (see Frame.IsRightHanded). Note that
the "handedness" of the frame does not, by itself, determine the surface's orientation.
halfAngle:
Cone angle. Must be not 0, lesser than PI/2 and greater than -PI/2.
Returns:
The created ConicalSurface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Frame object may not be used as a local frame of reference.
-or-
The supplied value must be not 0, lesser than PI/2 and greater than -PI/2.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ConicalSurface.HalfAngle
Cone angle.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.Origin
Apex of the cone. This is the origin of the local coordinate system associated with this cone.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.YDir
X axis of the local coordinate system associated with this cone.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.XDir
X axis of the local coordinate system associated with this cone.
Since:
2017

Autodesk.Revit.DB.ConicalSurface.Axis
Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
Since:
2017

Autodesk.Revit.DB.ConicalSurface
A Conical Surface.
Remarks:
The parametric equation of the cone is S(u, v) = center + v*[sin(halfAngle)(cos(u)*xVec + sin(u)*yVec) + cos(halfAngle)*zVec]. Only the branch of the cone with v >= 0 should be used.
Since:
2017